import pytest
from src.LW4 import PointAreaChecker

test_data_R_negative = [0, -0.001]

test_data = [
    # Область 1: x > 0 и y >= x
    # Внутри области
    (10, 3, 5, 1),
    (10, 5, 5, 1),
    (10, 5, 7, 1),
    (10, 0.001, 0.001, 1),
    # На границе y = x
    (10, 5, 5, 1),
    (10, 10 / 2**0.5, 10 / 2**0.5, 1),
    # Область 2: остальные точки внутри окружности
    (10, 5, 2, 2),
    (10, 5, -2, 2),
    (10, -5, 5, 2),
    # x = 0
    (10, 0, 5, 2),
    (10, 0, -5, 2),
    (10, 0, 0, 2),
    # y = 0
    (10, 5, 0, 2),
    (10, -5, 0, 2),
    # Область 1 с отрицательным x
    # Для x < 0 и y <= x
    (10, -3, -5, 1),
    (10, -5, -5, 1),
    (10, -5, -7, 1),
    # На границе y = x
    (10, -5, -5, 1),
    (10, -10 / 2**0.5, -10 / 2**0.5, 1),
    # Вне окружности
    (10, 15, 5, 3),
    (10, 10.001, 0, 3),
    (10, -10.001, 0, 3),
    (10, 0, 10.001, 3),
    (10, 0, -10.001, 3),
    # На границе окружности
    (10, 10, 0, 2),
    (10, -10, 0, 2),
    (10, 0, 10, 2),
    (10, 0, -10, 2),
    # Точки на окружности в областях
    (10, 10 / 2**0.5, 10 / 2**0.5, 1),
    (10, -10 / 2**0.5, -10 / 2**0.5, 1),
    (0.001, 0.0005, 0.0005, 1),
    (0.001, 0, 0, 2),
    (0.001, 0.001, 0, 2),
    (0.001, 0.0011, 0, 3),
]


@pytest.mark.parametrize("R,x,y,expected", test_data)
def test_point_checker(R, x, y, expected):
    checker = PointAreaChecker(R)
    assert checker.test_point(x, y) == expected


@pytest.mark.parametrize("R", test_data_R_negative)
def test_R_negative(R):
    with pytest.raises(ValueError):
        PointAreaChecker(R)
